content-org/o.org
* Idea Monkeysphere
:PROPERTIES:
:EXPORT_FILE_NAME: monkeysphere
:EXPORT_HUGO_SECTION: docs
:END:

there is only certain things i can learn in tths l
ofcourse learning will not be so learnier and well defined but i just wanted to lay out an outline for referece if i ever get lost.

I have other interests but i did not put them here because they are leisure time things and i should not feel pressured them at all

There's no priority in here, these are general popular things that i am interested in.

** Computer Science/Software Engineering
 | Topic                          | Why                                                                                                                                 | Depth(1-5) |
 | Computer Networks and Security | debug network problems, understand security, vpn, etc. Properly know how to defend and do some basic important attacks when needed. |          3 |
 | Network Programming            | Work on Web3.0, Contributed to netfliter/ebpf ecosystem.                                                                            |          3 |
 | Systems Programming            | Be able to performance test things, finetune stuff, Understand underlying things for all things systems                             |          4 |
 | Databases                      | Ability to write a DB and understand parts, contribute to some open source db                                                       |          2 |
 | Data structures and algorithms | Be abe to follow any algorithm that's laid out given enough time and convert it into a program                                      |          4 |
 | Distributed Systems            | Be able to plan things more precisely and not do blinder things                                                                     |          3 |
 | Compilers                      | When stuck with a parser/interpreter problem i am scared + idk what to do or expect. So need to fix that                            |          2 |
** Electronics
 | Topic                   | Why | Depth(1-5) |
 | Electronics Engineering |     |          1 |
 | Computer Arch           |     |          1 |
** Science
 | Topic     | Why | Depth(1-5) |
 | Physics   |     |          2 |
 | Mechanics |     |          1 |
** Math
 | Topic           | Why                                                             | Depth(1-5) |
 | Statistics      | I do not understand data, need to understand data               |          4 |
 | Number Theory   | Need help with thinking powerfully when dealing with algorithms |          3 |
 | Complex numbers |                                                                 |          1 |
 | Discrete Math   | Need to write proper proofs                                     |          3 |
 | Category Theory | Just because it sounds so cool and idk what the fuck it is      |          1 |
 | Calculus        |                                                                 |          1 |
 | Diff. Eqns      |                                                                 |          2 |
 | Linear Algebra  | Need to be clear about some numbers                             |          3 |
 | Real Analysis   |                                                                 |          1 |
** Data, Thinking and Information management
 | Topic              | Why                                                                                                                                                                                                                     | Depth(1-5) |
 | Writing            |                                                                                                                                                                                                                         |          4 |
 | Maps               |                                                                                                                                                                                                                         |          3 |
 | Data analysis      |                                                                                                                                                                                                                         |          4 |
 | Data vis           | I think i need to understand data, I am a very visual learner so I need to know what are my options when I have some data and I want to visualize it                                                                    |          3 |
 | Information theory |                                                                                                                                                                                                                         |          3 |
 | Thinking           | Be a more clear thinker, this is how i check if I am growing right. I need to be a better thinker every year. Introduce new ideas, be clear about intentions and things I speak. Improve the search engine of my brain. |          4 |
 | Philosophy         |                                                                                                                                                                                                                         |          2 |
** Web
 | Topic           | Why                                                           | Depth |
 | Web-development | Build things quickly                                          |     4 |
 | Web-hacking     | most of the things i want to build need hacking  of some sort |     4 |
** Education
 | Topic                         | Why | Depth(1-5) |
 | Education system of the world |     |          5 |
 | Education system of India     |     |          5 |
 | Real world situation          |     |          5 |
** World
 | Topic     | Why                                             | Depth |
 | Economics | Need to understand how world works              |     3 |
 | Finance   | Need to make some monie and manage my own money |     3 |
 | Business  |                                                 |     4 |
 | History   |                                                 |     3 |
